app/views/partials/_comments.html.erb

<ul style="list-style-type:none">
<% @article.comments.each do |comment|%>
---
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = $1  [["article_id", 13]]