app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."user_id" = $1 ORDER BY created_at ASC LIMIT $2 OFFSET $3  [["user_id", 1], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = $1  [["user_id", 1]]
---
    def index
        @articles=current_user.articles.order("created_at ASC").page params[:page]

INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Article By user 2"], ["body", "hello"], ["created_at", "2020-02-26 09:02:34.016678"], ["updated_at", "2020-02-26 09:02:34.016678"], ["user_id", 2]]
---
    def create
        @article=current_user.articles.new(article_params)
        if @article.save

UPDATE "articles" SET "body" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["body", "hello this is "], ["updated_at", "2020-02-26 09:02:46.079440"], ["id", 4]]
---
    def update
        if @article.update(article_params)

SELECT  "articles".* FROM "articles" WHERE "articles"."user_id" = $1 AND "articles"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
---
        def get_user_article
            @article=current_user.articles.find_by_id(params[:id])