app/controllers/comments_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 30], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["commenter", "Arslan"], ["body", "HASdhaslj"], ["article_id", 30], ["created_at", "2020-02-27 08:38:50.009767"], ["updated_at", "2020-02-27 08:38:50.009767"]]
---
    def create
        @article=Article.find(params[:article_id])
        @comment=@article.comments.create(comment_params)